# MEDIDAS TENDENCIA CENTRAL

In [3]:
import pandas as pd

In [4]:
alunos = ['Maria', 'Pedro','Joao','Ana','Paulo']

In [5]:
df = pd.DataFrame(index = alunos)

In [6]:
df

Empty DataFrame
Columns: []
Index: [Maria, Pedro, Joao, Ana, Paulo]

In [8]:
df['Matematica'] = [6,8,5,8,7]
df

       Matematica
Maria           6
Pedro           8
Joao            5
Ana             8
Paulo           7

In [9]:
df['PT'] = [5,6,5,9,8]
df

       Matematica  PT
Maria           6   5
Pedro           8   6
Joao            5   5
Ana             8   9
Paulo           7   8

# Media aritimetica

In [12]:
df['Matematica'].mean()

6.8

In [13]:
notas_concurso = [ 8.4,9.1,7.2,6.8]
df = pd.DataFrame()

In [14]:
df['notas'] = notas_concurso

In [15]:
df.mean()

notas    7.875
dtype: float64

In [16]:
df.median()

notas    7.8
dtype: float64

In [19]:
df.mode()

   notas
0    6.8
1    7.2
2    8.4
3    9.1